package com.ilanchuang.xiaoi.suoyiserver.mvpbe.bean;

import java.util.List;

import top.jplayer.baseprolibrary.mvp.model.bean.BaseBean;

/**
 * Created by Obl on 2018/10/11.
 * com.ilanchuang.xiaoi.suoyiserver.mvpbe.bean
 * call me : jplayer_top@163.com
 * github : https://github.com/oblivion0001
 */

public class CallMessageBean extends BaseBean {

    /**
     * type : 0
     * list : [{"orderid":"2017121914015298740","title":"1分钱测试","status":"已完成","price":"0.01","ct":"2017年12月19日 14:01","lt":"2018年01月25日 11:18"},{"orderid":"2017120415402381167","title":"1分钱测试","status":"已完成","price":"0.01","ct":"2017年12月04日 15:40","lt":"2018年01月25日 11:20"},{"orderid":"2017112011422189438","title":"1分钱测试","status":"已完成","price":"0.01","ct":"2017年11月20日 11:42","lt":"2018年02月02日 11:57"},{"orderid":"2017112011035081686","title":"1分钱测试","status":"已完成","price":"0.01","ct":"2017年11月20日 11:03","lt":"2018年02月02日 11:57"},{"orderid":"2017083120070769926","title":"1分钱测试","status":"已发货","price":"0.01","ct":"2017年08月31日 20:07","lt":"2018年01月25日 11:24"},{"orderid":"2017082611321614024","title":"1分钱测试","status":"待发货","price":"0.01","ct":"2017年08月26日 11:32","lt":"2017年08月26日 11:32"},{"orderid":"2017082611315684828","title":"西红柿盖浇饭","status":"待付款","price":"15.00","ct":"2017年08月26日 11:31","lt":"2017年08月26日 11:31"},{"orderid":"2017082611270418853","title":"1分钱测试","status":"待付款","price":"0.01","ct":"2017年08月26日 11:27","lt":"2017年08月26日 11:27"},{"orderid":"2017082418314313610","title":"1分钱测试","status":"待付款","price":"0.01","ct":"2017年08月24日 18:31","lt":"2017年08月24日 18:31"},{"orderid":"2017082418295376164","title":"1分钱测试","status":"待发货","price":"0.01","ct":"2017年08月24日 18:29","lt":"2017年08月24日 18:30"},{"orderid":"2017082418213193926","title":"1分钱测试","status":"待付款","price":"0.01","ct":"2017年08月24日 18:21","lt":"2017年08月24日 18:21"},{"orderid":"2017082418195420581","title":"1分钱测试","status":"待付款","price":"0.01","ct":"2017年08月24日 18:19","lt":"2017年08月24日 18:19"},{"orderid":"2017082418184453381","title":"1分钱测试","status":"待付款","price":"0.01","ct":"2017年08月24日 18:18","lt":"2017年08月24日 18:18"},{"orderid":"2017082418171017481","title":"1分钱测试","status":"待付款","price":"0.01","ct":"2017年08月24日 18:17","lt":"2017年08月24日 18:17"},{"orderid":"2017082418104694488","title":"1分钱测试","status":"待发货","price":"0.01","ct":"2017年08月24日 18:10","lt":"2017年08月24日 18:11"},{"orderid":"2017082415442778701","title":"1分钱测试","status":"待付款","price":"0.01","ct":"2017年08月24日 15:44","lt":"2017年08月24日 15:44"},{"orderid":"2017082415335714265","title":"1分钱测试","status":"待付款","price":"0.01","ct":"2017年08月24日 15:33","lt":"2017年08月24日 15:33"},{"orderid":"2017082415220171944","title":"1分钱测试","status":"待付款","price":"0.01","ct":"2017年08月24日 15:22","lt":"2017年08月24日 15:22"},{"orderid":"2017082415214448567","title":"钟点工 特检2分钱每小时","status":"已完成","price":"0.02","ct":"2017年08月24日 15:21","lt":"2017年08月24日 18:17"},{"orderid":"2017082415214277656","title":"钟点工 特检2分钱每小时","status":"待付款","price":"0.02","ct":"2017年08月24日 15:21","lt":"2017年08月24日 15:21"},{"orderid":"2017082415213038314","title":"钟点工 特检2分钱每小时","status":"待发货","price":"0.02","ct":"2017年08月24日 15:21","lt":"2017年08月24日 15:21"},{"orderid":"2017082415212235785","title":"金盘保姆 每月仅需1毛钱 走过路过不要错过 1毛钱买不了吃亏买不了上当","status":"待付款","price":"0.10","ct":"2017年08月24日 15:21","lt":"2017年08月24日 15:21"},{"orderid":"2017082415210976974","title":"钟点工 特检2分钱每小时","status":"待发货","price":"0.02","ct":"2017年08月24日 15:21","lt":"2017年08月24日 15:21"},{"orderid":"2017082415191181225","title":"1分钱测试","status":"待发货","price":"0.01","ct":"2017年08月24日 15:19","lt":"2017年08月24日 15:19"},{"orderid":"2017082415153093891","title":"钟点工 特检2分钱每小时","status":"待发货","price":"0.02","ct":"2017年08月24日 15:15","lt":"2017年08月24日 15:15"},{"orderid":"2017082415152019724","title":"金盘保姆 每月仅需1毛钱 走过路过不要错过 1毛钱买不了吃亏买不了上当","status":"待付款","price":"0.10","ct":"2017年08月24日 15:15","lt":"2017年08月24日 15:15"},{"orderid":"2017082415125035969","title":"1分钱测试","status":"已完成","price":"0.01","ct":"2017年08月24日 15:12","lt":"2017年08月29日 17:31"},{"orderid":"2017082415122150718","title":"1分钱测试","status":"待发货","price":"0.01","ct":"2017年08月24日 15:12","lt":"2017年08月24日 15:12"},{"orderid":"2017082415121762353","title":"1分钱测试","status":"待付款","price":"0.01","ct":"2017年08月24日 15:12","lt":"2017年08月24日 15:12"},{"orderid":"2017082415095162164","title":"1分钱测试","status":"待付款","price":"0.01","ct":"2017年08月24日 15:09","lt":"2017年08月24日 15:09"},{"orderid":"2017082415080846484","title":"1分钱测试","status":"待发货","price":"0.01","ct":"2017年08月24日 15:08","lt":"2017年08月24日 15:08"},{"orderid":"2017082415023442535","title":"金盘保姆 每月仅需1毛钱 走过路过不要错过 1毛钱买不了吃亏买不了上当","status":"待付款","price":"0.10","ct":"2017年08月24日 15:02","lt":"2017年08月24日 15:02"},{"orderid":"2017082414325686177","title":"金盘保姆 每月仅需1毛钱 走过路过不要错过 1毛钱买不了吃亏买不了上当","status":"待付款","price":"0.10","ct":"2017年08月24日 14:32","lt":"2017年08月24日 14:32"},{"orderid":"2017082414282524484","title":"1分钱测试","status":"待付款","price":"0.01","ct":"2017年08月24日 14:28","lt":"2017年08月24日 14:28"},{"orderid":"2017082414251539808","title":"1分钱测试","status":"待付款","price":"0.01","ct":"2017年08月24日 14:25","lt":"2017年08月24日 14:25"},{"orderid":"2017082414250469250","title":"1分钱测试","status":"待付款","price":"0.01","ct":"2017年08月24日 14:25","lt":"2017年08月24日 14:25"},{"orderid":"2017082410513918835","title":"1分钱测试","status":"待付款","price":"0.01","ct":"2017年08月24日 10:51","lt":"2017年08月24日 10:51"},{"orderid":"2017082410513918839","title":"1分钱测试","status":"待付款","price":"0.01","ct":"2017年08月24日 10:51","lt":"2017年08月24日 10:51"},{"orderid":"2017082410513918838","title":"1分钱测试","status":"待付款","price":"0.01","ct":"2017年08月24日 10:51","lt":"2017年08月24日 10:51"},{"orderid":"2017082410513918837","title":"1分钱测试","status":"待付款","price":"0.01","ct":"2017年08月24日 10:51","lt":"2017年08月24日 10:51"},{"orderid":"2017082410513918810","title":"1分钱测试","status":"待付款","price":"0.01","ct":"2017年08月24日 10:51","lt":"2017年08月24日 10:51"},{"orderid":"2017082410513918836","title":"1分钱测试","status":"待付款","price":"0.01","ct":"2017年08月24日 10:51","lt":"2017年08月24日 10:51"},{"orderid":"2017082410513918834","title":"1分钱测试","status":"待付款","price":"0.01","ct":"2017年08月24日 10:51","lt":"2017年08月24日 10:51"},{"orderid":"2017082410513918833","title":"1分钱测试","status":"待付款","price":"0.01","ct":"2017年08月24日 10:51","lt":"2017年08月24日 10:51"},{"orderid":"2017082410513918832","title":"1分钱测试","status":"待付款","price":"0.01","ct":"2017年08月24日 10:51","lt":"2017年08月24日 10:51"},{"orderid":"2017082410513918831","title":"1分钱测试","status":"待付款","price":"0.01","ct":"2017年08月24日 10:51","lt":"2017年08月24日 10:51"}]
     */

    public int type;
    public List<ListBean> list;

    public static class ListBean {
        /**
         * orderid : 2017121914015298740
         * title : 1分钱测试
         * status : 已完成
         * price : 0.01
         * ct : 2017年12月19日 14:01
         * lt : 2018年01月25日 11:18
         */
        public int rid;
        public String rname;
        public String orderid;
        public String title;
        public String status;
        public String price;
        public String ct;
        public String lt;
    }
}
